In [1]:
import pandas as pd
import numpy as np

In [2]:
dict1 ={
    "name": ['abhay','harry','kunal','aish'],
    "marks":[95,54,47,45],
    "city":['r','j','y','u']
}

In [3]:
df =  pd.DataFrame(dict1)

In [4]:
df

    name  marks city
0  abhay     95    r
1  harry     54    j
2  kunal     47    y
3   aish     45    u

In [5]:
df.to_csv('friends.csv')

df.to_csv('frie.csv', index=false)

In [15]:
df.head(3)

    name  marks city
0  abhay     95    r
1  harry     54    j
2  kunal     47    y

In [17]:
df.tail(2)

    name  marks city
2  kunal     47    y
3   aish     45    u

In [18]:
df.describe

<bound method NDFrame.describe of     name  marks city
0  abhay     95    r
1  harry     54    j
2  kunal     47    y
3   aish     45    u>

In [19]:
df.describe()

           marks
count   4.000000
mean   60.250000
std    23.485811
min    45.000000
25%    46.500000
50%    50.500000
75%    64.250000
max    95.000000

In [23]:
harry = pd.read_csv('friends.csv')

In [24]:
harry

   Unnamed: 0  train   speed city
0           0    4855     95    r
1           1   74858     54    j
2           2   18555     47    y
3           3    5885     45    u

friends['speed']

In [25]:
harry

   Unnamed: 0  train   speed city
0           0    4855     95    r
1           1   74858     54    j
2           2   18555     47    y
3           3    5885     45    u

In [29]:
harry["speed"][2] = 54

c:\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

harry